Repository: featdd/dpn_glossary
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# tx_dpnglossary_domain_model_term
source: Term
de: Begriff

# tx_dpnglossary_domain_model_term.name
source: name of the term
de: Name des Begriffes

# tx_dpnglossary_domain_model_term.tooltiptext
source: text shown in the css tooltip
de: Text der im CSS Tooltip angezeigt wird

# tx_dpnglossary_domain_model_term.description
source: description of the term
de: Beschreibung des Begriffes

# tx_dpnglossary_domain_model_term.name_alternative
source: Alternative names
de: Alternative Namen

# tx_dpnglossary_domain_model_term.term_type
source: Type of term
de: Typ des Begriff

# tx_dpnglossary_domain_model_term.term_type_acronym
source: Acronym (e.g. NATO)
de: Kurzwort aus Anfangsbuchstaben (Beispiel: NATO)

# tx_dpnglossary_domain_model_term.term_type_abbrevation
source: Abbrevation (e.t.c.)
de: Abkürzung (Beispiel: u.s.w.)

# tx_dpnglossary_domain_model_term.term_type_none
source: None (Tooltip)
de: Einfacher Tooltip

# tx_dpnglossary_domain_model_term.term_lang
source: Language of the term (2 char ISO code)
de: Sprache des Begriffs (2 Zeichen ISO Code)

# tx_dpnglossary_domain_model_term.images
source: Images
de: Bilder

# tx_dpnglossary_domain_model_term.detailheadline
source: Detailview for term
de: Detailansicht für den Begriff

# tx_dpnglossary_domain_model_term.listheadline
source: Listview for the terms
de: Listenansicht für die Begriffe

# tx_dpnglossary_domain_model_term.characterheadline
source: Character Navigation for the terms
de: Buchstaben-Navigation für die Begriffe

# tx_dpnglossary.backtolastpage
source: Back to last page
de: Zurück zur letzten Seite

# tx_dpnglossary.backtolist
source: Back to list
de: Zurück zur Liste
