Repository: featdd/dpn_glossary
Catalog: Configuration/Sets/Default/*.labels.xlf
Languages: de

# categories.dpn.functions.glossary
source: Glossary
de: Glossar

# settings.glossary.storagePidList
source: Glossary term storage PageID list
de: Glossar-Begriffe Speicherort PageID Liste

# settings.description.glossary.storagePidList
source: Folders PageIDs (comma list) which contains the glossary terms
de: Ordner PageIDs (kommagetrennte Liste), welche die Glossar-Begriffe beinhalten

# settings.glossary.glossaryPage
source: Glossary page PageID
de: Glossarseiten PageID

# settings.description.glossary.glossaryPage
source: PageID of the detailpage for parsed terms
de: PageID der Detailseite für geparste Begriffe

# settings.glossary.parsingPids
source: Parsing Pages
de: Zu parsende Seiten

# settings.description.glossary.parsingPids
source: Pages PageIDs (comma list) which should be parsed for glossary terms (0 = all)
de: Seiten PageIDs (kommagetrennte Liste), die nach Glossar-Begriffen durchsucht werden sollen (0 = alle)

# settings.glossary.parsingExcludePidList
source: Exclude Pages
de: Ausgeschlossene Seiten

# settings.description.glossary.parsingExcludePidList
source: Pages PageIDs (comma list) which should not be parsed for glossary terms
de: Seiten PageIDs (kommagetrennte Liste), die nicht nach Glossar-Begriffen durchsucht werden sollen

# settings.glossary.parsingSpecialWrapCharacters
source: Parsing Special Wrap Characters
de: Parsing-Spezialzeichen

# settings.description.glossary.parsingSpecialWrapCharacters
source: Additional special characters to respect in parser regular expression
de: Zusätzliche Sonderzeichen, die in der Parser-Regular-Expression berücksichtigt werden sollen

# settings.glossary.parserRepositoryClass
source: Parser Repository Class
de: Parser Repository Klasse

# settings.description.glossary.parserRepositoryClass
source: The repository class used in the parser service
de: Die im Parser-Service verwendete Repository-Klasse

# settings.glossary.maxReplacementPerPage
source: Maximum Replacements Per Page
de: Maximale Ersetzungen pro Seite

# settings.description.glossary.maxReplacementPerPage
source: Maximum replacements for each term (-1 = any)
de: Maximale Ersetzungen für jeden Begriff (-1 = unbegrenzt)

# settings.glossary.maxReplacementPerPageRespectSynonyms
source: Respect Replacement Counter for Synonyms
de: Ersetzungszähler für Synonyme berücksichtigen

# settings.description.glossary.maxReplacementPerPageRespectSynonyms
source: Respect replacement counter when parsing synonyms
de: Ersetzungszähler beim Parsen von Synonymen berücksichtigen

# settings.description.glossary.parsingTags
source: Tags which content will be parsed for terms
de: Tags, deren Inhalt nach Begriffen durchsucht wird

# settings.glossary.forbiddenParentTags
source: Forbidden Parent Tags
de: Verbotene Eltern-Tags

# settings.description.glossary.forbiddenParentTags
source: Tags which are not allowed as direct parent for a parsingTag
de: Tags, die nicht als direktes Elternelement für ein Parsing-Tag erlaubt sind

# settings.glossary.forbiddenParsingTagClasses
source: Forbidden Parsing Tag Classes
de: Verbotene Parsing-Tag-Klassen

# settings.description.glossary.forbiddenParsingTagClasses
source: Classes which are not allowed for the parsing tag
de: Klassen, die für das Parsing-Tag nicht erlaubt sind

# settings.glossary.forbiddenParentClasses
source: Forbidden Parent Classes
de: Verbotene Eltern-Klassen

# settings.description.glossary.forbiddenParentClasses
source: Classes which are not allowed on any parent of the parsing tag
de: Klassen, die auf keinem Elternelement des Parsing-Tags erlaubt sind

# settings.glossary.listmode
source: List Mode
de: Listen-Modus

# settings.description.glossary.listmode
source: Listmode: normal, character or paginated by characters
de: Listen-Modus: normal, zeichenbasiert oder nach Zeichen paginiert

# settings.glossary.previewmode
source: Preview Mode
de: Vorschau-Modus

# settings.description.glossary.previewmode
source: Previewmode: newest or random
de: Vorschau-Modus: neueste oder zufällig

# settings.glossary.previewlimit
source: Preview Limit
de: Vorschau-Limit

# settings.description.glossary.previewlimit
source: Previewlimit
de: Vorschau-Limit

# settings.glossary.disableParser
source: Disable Parser
de: Parser deaktivieren

# settings.description.glossary.disableParser
source: Disable parser (default: enabled)
de: Parser deaktivieren (Standard: aktiviert)

# settings.glossary.parseSynonyms
source: Parse Synonyms
de: Synonyme parsen

# settings.description.glossary.parseSynonyms
source: Parse the terms synonyms (default: enabled)
de: Synonyme der Begriffe parsen (Standard: aktiviert)

# settings.glossary.priorisedSynonymParsing
source: Priorise Synonym Parsing
de: Synonym-Parsing priorisieren

# settings.description.glossary.priorisedSynonymParsing
source: Priorise the synonyms before the actual term when parsing (default: enabled)
de: Synonyme vor dem eigentlichen Begriff beim Parsen priorisieren (Standard: aktiviert)

# settings.glossary.limitParsingId
source: Limit Parsing ID
de: Parsing-ID begrenzen

# settings.description.glossary.limitParsingId
source: Limit parsing to a single node with this ID
de: Parsing auf einen einzelnen Knoten mit dieser ID begrenzen

# settings.glossary.useTermForSynonymParsingDataWrap
source: Use Term for Synonym Parsing Data Wrap
de: Begriff für Synonym-Parsing Data Wrap verwenden

# settings.description.glossary.useTermForSynonymParsingDataWrap
source: Use the origin term for content object data when parsing synonyms (default: disabled)
de: Ursprünglichen Begriff für Content-Object-Daten beim Parsen von Synonymen verwenden (Standard: deaktiviert)

# settings.glossary.addStylesheet
source: Add Stylesheet
de: Stylesheet hinzufügen

# settings.description.glossary.addStylesheet
source: Add the extension stylesheet (default: enabled)
de: Erweiterungs-Stylesheet hinzufügen (Standard: aktiviert)

# settings.glossary.overrideFluidStyledContentLayout
source: Override Fluid Styled Content Layout
de: Fluid Styled Content Layout überschreiben

# settings.description.glossary.overrideFluidStyledContentLayout
source: Override fluid styled content layout to enable dynamic exclusion via content properties (default: enabled)
de: Fluid Styled Content Layout überschreiben, um dynamischen Ausschluss über Content-Eigenschaften zu ermöglichen (Standard: aktiviert)

# settings.glossary.excludeTermLinksTargetPages
source: Exclude Term Links Target Pages
de: Zielseiten von Begriffs-Links ausschließen

# settings.description.glossary.excludeTermLinksTargetPages
source: Don't parse terms when current page is the term links target (default: disabled)
de: Begriffe nicht parsen, wenn die aktuelle Seite das Ziel der Begriff-Links ist (Standard: deaktiviert)
